#Создать строку равную предпоследнему символу введнной строки

string = input("Введите строку: \n")
s = string[-2]

print(s)
