#Создать строку, равную третьему символу введенной строки
string = input("Введите строку: \n")
s = string[2]

print(s)
